{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 446,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 447,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 448,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 449,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 450,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ã": 132,
      "Ä": 133,
      "Å": 134,
      "Æ": 135,
      "Ç": 136,
      "È": 137,
      "É": 138,
      "Ê": 139,
      "Ë": 140,
      "Ì": 141,
      "Í": 142,
      "Î": 143,
      "Ï": 144,
      "Ð": 145,
      "Ñ": 146,
      "Ò": 147,
      "Ó": 148,
      "Ô": 149,
      "Õ": 150,
      "Ö": 151,
      "×": 152,
      "Ø": 153,
      "Ù": 154,
      "Ú": 155,
      "Û": 156,
      "Ü": 157,
      "Ý": 158,
      "Þ": 159,
      "ß": 160,
      "à": 161,
      "á": 162,
      "â": 163,
      "ã": 164,
      "ä": 165,
      "å": 166,
      "æ": 167,
      "ç": 168,
      "è": 169,
      "é": 170,
      "ê": 171,
      "ë": 172,
      "ì": 173,
      "í": 174,
      "î": 175,
      "ï": 176,
      "ð": 177,
      "ñ": 178,
      "ò": 179,
      "ó": 180,
      "ô": 181,
      "õ": 182,
      "ö": 183,
      "÷": 184,
      "ø": 185,
      "ù": 186,
      "ú": 187,
      "û": 188,
      "ü": 189,
      "ý": 190,
      "þ": 191,
      "ÿ": 192,
      "Ā": 193,
      "ā": 194,
      "Ă": 195,
      "ă": 196,
      "Ą": 197,
      "ą": 198,
      "Ć": 199,
      "ć": 200,
      "Ĉ": 201,
      "ĉ": 202,
      "Ċ": 203,
      "ċ": 204,
      "Č": 205,
      "č": 206,
      "Ď": 207,
      "ď": 208,
      "Đ": 209,
      "đ": 210,
      "Ē": 211,
      "ē": 212,
      "Ĕ": 213,
      "ĕ": 214,
      "Ė": 215,
      "ė": 216,
      "Ę": 217,
      "ę": 218,
      "Ě": 219,
      "ě": 220,
      "Ĝ": 221,
      "ĝ": 222,
      "Ğ": 223,
      "ğ": 224,
      "Ġ": 225,
      "ġ": 226,
      "Ģ": 227,
      "ģ": 228,
      "Ĥ": 229,
      "ĥ": 230,
      "Ħ": 231,
      "ħ": 232,
      "Ĩ": 233,
      "ĩ": 234,
      "Ī": 235,
      "ī": 236,
      "Ĭ": 237,
      "ĭ": 238,
      "Į": 239,
      "į": 240,
      "İ": 241,
      "ı": 242,
      "Ĳ": 243,
      "ĳ": 244,
      "Ĵ": 245,
      "ĵ": 246,
      "Ķ": 247,
      "ķ": 248,
      "ĸ": 249,
      "Ĺ": 250,
      "ĺ": 251,
      "Ļ": 252,
      "ļ": 253,
      "Ľ": 254,
      "ľ": 255,
      "Ŀ": 256,
      "ŀ": 257,
      "Ł": 258,
      "ł": 259,
      "Ń": 260,
      "00": 261,
      "ff": 262,
      "0000": 263,
      "ar": 264,
      "var": 265,
      "ffff": 266,
      ",)": 267,
      "00000000": 268,
      "or": 269,
      "st": 270,
      "stor": 271,
      "ffffffff": 272,
      "?{": 273,
      "})": 274,
      "20": 275,
      "0000000000000000": 276,
      "(!": 277,
      "})})": 278,
      ",)?{": 279,
      "ffffffffffffffff": 280,
      ";(!": 281,
      "ap": 282,
      "map": 283,
      "+(": 284,
      "en": 285,
      "nt": 286,
      "re": 287,
      "arg": 288,
      "((": 289,
      "==": 290,
      "int": 291,
      "de": 292,
      "12": 293,
      "ac": 294,
      "uint": 295,
      ",)==": 296,
      "00000000000000000000000000000000": 297,
      "])": 298,
      "gt": 299,
      "len": 300,
      ";(!(": 301,
      "128": 302,
      "gth": 303,
      "length": 304,
      "ct": 305,
      "ed": 306,
      "fu": 307,
      "io": 308,
      "nct": 309,
      "rn": 310,
      "tu": 311,
      "ffffffffffffffffffffffffffffffff": 312,
      "retu": 313,
      "funct": 314,
      "ion": 315,
      "return": 316,
      "function": 317,
      "co": 318,
      ",)<": 319,
      "res": 320,
      "01": 321,
      "ms": 322,
      ",),)": 323,
      ",)==((": 324,
      "msg": 325,
      "48": 326,
      "56": 327,
      "<(": 328,
      "Un": 329,
      "ca": 330,
      "sen": 331,
      "der": 332,
      "sender": 333,
      "100000000000000000000000000000000": 334,
      "256": 335,
      "7100000000000000000000000000000000": 336,
      "ad": 337,
      "cca": 338,
      "ecca": 339,
      "kecca": 340,
      "lv": 341,
      "olv": 342,
      "ĠUn": 343,
      ",)>": 344,
      "000000000000000000000000": 345,
      "})})})": 346,
      ",)?{})": 347,
      "code": 348,
      "resolv": 349,
      "487": 350,
      "7100000000000000000000000000000000000000000000000000000000": 351,
      "keccak": 352,
      "ĠUnresolv": 353,
      "ĠUnresolved": 354,
      "]=": 355,
      "}}": 356,
      "?{(!": 357,
      ",)?{(!": 358,
      ",)>(": 359,
      "){": 360,
      ")}": 361,
      "02": 362,
      "Pac": 363,
      "ab": 364,
      "as": 365,
      "er": 366,
      "fac": 367,
      "ked": 368,
      "xffffffffffffffffffffffffffffffff": 369,
      "Ġvar": 370,
      ",)+(": 371,
      "encode": 372,
      ",)==(": 373,
      "})})});(!(": 374,
      ",)?{});(!": 375,
      "?{(!(": 376,
      "Packed": 377,
      "abi": 378,
      "ash": 379,
      "erfac": 380,
      "encodePacked": 381,
      "erface": 382,
      "),)": 383,
      "),)==(": 384,
      "40": 385,
      ";(": 386,
      ">>": 387,
      "Id": 388,
      "]?{": 389,
      "dres": 390,
      "tr": 391,
      "unt": 392,
      "{(": 393,
      ",);(!(": 394,
      "})})}": 395,
      "interface": 396,
      "acco": 397,
      "addres": 398,
      "xffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff": 399,
      "interfaceId": 400,
      "account": 401,
      "address": 402,
      "!=": 403,
      "03": 404,
      "23": 405,
      "27": 406,
      "47": 407,
      "65": 408,
      ";((": 409,
      "Hash": 410,
      "Ti": 411,
      "]+": 412,
      "]-": 413,
      "ck": 414,
      "hash": 415,
      "in": 416,
      "lo": 417,
      "me": 418,
      "ue": 419,
      "|(": 420,
      ",)*": 421,
      ",)-": 422,
      ",),)?{": 423,
      "?{(": 424,
      "})});": 425,
      "})})})})});(!(": 426,
      "})})})});": 427,
      ",)?{})})});(!(": 428,
      ",)?{})})}": 429,
      "+(((": 430,
      "])?{": 431,
      ",),)/": 432,
      ",),);": 433,
      ",),),)?{});(!": 434,
      "adin": 435,
      "codehash": 436,
      ")};": 437,
      ")}})})})})});(!(": 438,
      "true": 439,
      "accountHash": 440,
      "Time": 441,
      "ckTime": 442,
      "lockTime": 443,
      ",),)?{((": 444,
      "ading": 445
    },
    "merges": [
      "0 0",
      "f f",
      "00 00",
      "a r",
      "v ar",
      "ff ff",
      ", )",
      "0000 0000",
      "o r",
      "s t",
      "st or",
      "ffff ffff",
      "? {",
      "} )",
      "2 0",
      "00000000 00000000",
      "( !",
      "}) })",
      ",) ?{",
      "ffffffff ffffffff",
      "; (!",
      "a p",
      "m ap",
      "+ (",
      "e n",
      "n t",
      "r e",
      "ar g",
      "( (",
      "= =",
      "i nt",
      "d e",
      "1 2",
      "a c",
      "u int",
      ",) ==",
      "0000000000000000 0000000000000000",
      "] )",
      "g t",
      "l en",
      ";(! (",
      "12 8",
      "gt h",
      "len gth",
      "c t",
      "e d",
      "f u",
      "i o",
      "n ct",
      "r n",
      "t u",
      "ffffffffffffffff ffffffffffffffff",
      "re tu",
      "fu nct",
      "io n",
      "retu rn",
      "funct ion",
      "c o",
      ",) <",
      "re s",
      "0 1",
      "m s",
      ",) ,)",
      ",)== ((",
      "ms g",
      "4 8",
      "5 6",
      "< (",
      "U n",
      "c a",
      "s en",
      "de r",
      "sen der",
      "1 00000000000000000000000000000000",
      "2 56",
      "7 100000000000000000000000000000000",
      "a d",
      "c ca",
      "e cca",
      "k ecca",
      "l v",
      "o lv",
      "Ġ Un",
      ",) >",
      "0000000000000000 00000000",
      "})}) })",
      ",)?{ })",
      "co de",
      "res olv",
      "48 7",
      "7100000000000000000000000000000000 000000000000000000000000",
      "kecca k",
      "ĠUn resolv",
      "ĠUnresolv ed",
      "] =",
      "} }",
      "?{ (!",
      ",)?{ (!",
      ",)> (",
      ") {",
      ") }",
      "0 2",
      "P ac",
      "a b",
      "a s",
      "e r",
      "f ac",
      "k ed",
      "x ffffffffffffffffffffffffffffffff",
      "Ġ var",
      ",) +(",
      "en code",
      ",)== (",
      "})})}) ;(!(",
      ",)?{}) ;(!",
      "?{(! (",
      "Pac ked",
      "ab i",
      "as h",
      "er fac",
      "encode Packed",
      "erfac e",
      ") ,)",
      ") ,)==(",
      "4 0",
      "; (",
      "> >",
      "I d",
      "] ?{",
      "d res",
      "t r",
      "u nt",
      "{ (",
      ",) ;(!(",
      "})}) }",
      "int erface",
      "ac co",
      "ad dres",
      "xffffffffffffffffffffffffffffffff ffffffffffffffffffffffffffffffff",
      "interface Id",
      "acco unt",
      "addres s",
      "! =",
      "0 3",
      "2 3",
      "2 7",
      "4 7",
      "6 5",
      "; ((",
      "H ash",
      "T i",
      "] +",
      "] -",
      "c k",
      "h ash",
      "i n",
      "l o",
      "m e",
      "u e",
      "| (",
      ",) *",
      ",) -",
      ",) ,)?{",
      "?{ (",
      "})}) ;",
      "})}) })})});(!(",
      "})}) })});",
      ",)?{ })})});(!(",
      ",)?{ })})}",
      "+( ((",
      "]) ?{",
      ",),) /",
      ",),) ;",
      ",),) ,)?{});(!",
      "ad in",
      "code hash",
      ")} ;",
      ")} })})})})});(!(",
      "tr ue",
      "account Hash",
      "Ti me",
      "ck Time",
      "lo ckTime",
      ",),)?{ ((",
      "adin g"
    ]
  }
}